spec/genesis_ruby/fixtures/responses/gate_wpf_payment.xml

<?xml version="1.0" encoding="UTF-8"?>
<wpf_payment>
  <status>new</status>
  <unique_id>1c4ae3aee01fe6fcc346b6c54074d26b</unique_id>
  <transaction_id>73ff91616e6e5</transaction_id>
  <timestamp>2023-03-07T11:31:47Z</timestamp>
  <amount>99</amount>
  <currency>EUR</currency>
  <redirect_url>https://staging.wpf.emerchantpay.net/en/v2/payment/1c4ae3aee01fe6fcc346b6c54074d26b</redirect_url>
  <empty/>
</wpf_payment>
